metadata-api-updateMetadata.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:met="http://soap.sforce.com/2006/04/metadata" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <met:SessionHeader>
            <met:sessionId>{{SessionId}}</met:sessionId>
        </met:SessionHeader>
    </soapenv:Header>
    <soapenv:Body>
        <met:updateMetadata>
            <metadata xsi:type="met:CustomObject">
                <fullName>Invoice__c</fullName>
                <label>Invoice</label>
                <pluralLabel>Invoices</pluralLabel>
                <sharingModel>Read</sharingModel>
                <description>This object stores the Invoice Header details.</description>
                <deploymentStatus>Deployed</deploymentStatus>
                <nameField>
                    <label>ID</label>
                    <type>AutoNumber</type>
                </nameField>
            </metadata>
            <metadata xsi:type="met:CustomField">
                <fullName>Invoice__c.Invoice_Date__c</fullName>
                <label>Invoice Date</label>
                <type>Date</type>
                <inlineHelpText>Please enter the date of the Invoice. This date must be less than or equal to today's date</inlineHelpText>
            </metadata>
            <metadata xsi:type="met:CustomField">
                <fullName>Invoice__c.Invoice_No__c</fullName>
                <label>Invoice No</label>
                <type>Text</type>
                <length>25</length>
                <inlineHelpText>the Invoice no. must be less than 25 characters and must be unique.</inlineHelpText>
            </metadata>
        </met:updateMetadata>
    </soapenv:Body>
</soapenv:Envelope>
